# Getting Started with pandas

In [1]:
#import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4,7,-5,3])
obj

NameError: name 'pd' is not defined

In [ ]:
obj.array

In [ ]:
obj.index

In [ ]:
obj2 = pd.Series([4,7,-5,3], index=['c','d','a','b'])
for i in obj2.index:
    print(i, obj2[i])

In [ ]:
obj2['c']

In [ ]:
obj2[['d','a']]

In [ ]:
obj2[obj2>=4]

In [ ]:
obj2 * 2

In [ ]:
import numpy as np
np.exp(obj2)

In [ ]:
kk = np.exp(obj2)
print(type(kk))

In [ ]:
'd' in obj2

In [ ]:
sdata= {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

In [ ]:
obj3.index

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

In [ ]:
obj4.isna()

In [ ]:
obj4.notna()

In [ ]:
obj3

In [ ]:
obj4

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'City'
obj4.index.name = 'Population'

In [ ]:
obj4

In [ ]:
obj = pd.Series([4,7,-5,3])
obj

In [ ]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [ ]:
obj

## DataFrame

In [6]:
import pandas as pd

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [9]:
pd.DataFrame(data, columns=['year','state','pop']) # in this order

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [10]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                           index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [11]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [12]:
frame2.dtypes

year       int64
state     object
pop      float64
debt      object
dtype: object

In [13]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [14]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [15]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [16]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [17]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [18]:
frame2.pop # ¿porqué?

<bound method DataFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

frame2

In [19]:
print(frame2)
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [20]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [21]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [22]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [23]:
kk=pd.Series([1,2,3,4])
kk.name='kk1'
kk

0    1
1    2
2    3
3    4
Name: kk1, dtype: int64

In [24]:
frame2['debt'] = 19.69
frame2.loc['three']

year      2002
state     Ohio
pop        3.6
debt     19.69
Name: three, dtype: object

In [25]:
frame2

       year   state  pop   debt
one    2000    Ohio  1.5  19.69
two    2001    Ohio  1.7  19.69
three  2002    Ohio  3.6  19.69
four   2001  Nevada  2.4  19.69
five   2002  Nevada  2.9  19.69
six    2003  Nevada  3.2  19.69

In [26]:
import numpy as np
frame2.debt = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [27]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [28]:
frame2['easter'] = frame2.state == 'Ohio'

In [29]:
frame2

       year   state  pop  debt  easter
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False
six    2003  Nevada  3.2   NaN   False

In [30]:
del frame2['easter']

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [43]:
pop = {'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},        
       'Nevada': {2001: 2.4, 2002: 2.9}}
pop

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [66]:
frame3 = pd.DataFrame(pop)
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [67]:
frame3.T[2002]

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [68]:
pop

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [69]:
frame4 = pd.DataFrame(pop, index=[2000, 2001, 2002])

In [70]:
frame4.dtypes

Ohio      float64
Nevada    float64
dtype: object

In [71]:
frame4.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [74]:
display(frame3)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [101]:
 frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [102]:
frame3.index.name = 'year'
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [103]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [105]:
frame3.columns.name = "state"
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [106]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [107]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [108]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

## Index Objects

In [109]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [121]:
# index[2] = "d" # gives an error. Index is inmutable

In [123]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [125]:
obj2 = pd.Series([2.4,5.6,1.5], index=labels)
obj2

0    2.4
1    5.6
2    1.5
dtype: float64

In [127]:
obj2.index is labels

True

In [128]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [129]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [130]:
'Ohio' in frame3.columns

True

In [131]:
2002 in frame3.index

True

In [132]:
2003 in frame3.index

False

In [134]:
'2002' in frame3.index

False

In [135]:
2000+2 in frame3.index

True

In [141]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')